#include "Exercises.h"
#include <iostream>


using namespace std;

int main()
{
   // Упражнение 1. Создание списка студентов
    Exercise1();
   // Упражнение 2. Создание шаблонной функции для работы с кортежем
   // Exercise2();
   // Упражнение 3. Использование шаблонной функции для работы с кортежем любого размера
   //  Exercise3();
   // Упражнение 4. Использование шаблонного класса массива
   //  Exercise4();
   // Упражнение 5. Шаблонная функция с ограничением типов
   //Exercise5();


   // Контрольные задания
   // Задание 1. Шаблонная функция обработки массива
   // ControlTask1();
   // Задание 2. Шаблонная функция вывода данных в поток
   // ControlTask2();
   // Задание 3. Шаблонная функция maxOfTwo с ограничением
   // ControlTask3();
   // Задание 4. Шаблонная функция для сортировки (опционально)
   //ControlTask4();
}