#include "Exercises.h"
#include <iostream>


using namespace std;

int main()
{
   // Упражнение 1. Перегрузка бинарных операций
   // Exercise1();
   // Упражнение 2. Преобразования объектов в основные типы и наоборот
   // Exercise2();
   // Упражнение 3. Перегрузка операций операндов различных типов
   //  Exercise3();
   // Упражнение 4. Перегрузка оператора индексации
     Exercise4();


   // Контрольные задания
   // Задание 1. Безопасная реализация класса Triangle
   // ControlTask1();
   // Задание 2. Безопасная реализация класса Time
   // ControlTask2();
}