#include "Exercises.h"
#include <iostream>


using namespace std;

int main()
{
   // Упражнение 1. Создание шаблонной функции сортировки массива
   // Exercise1();
   // Упражнение 2. Создание шаблонной функции для работы с кортежем
    Exercise2();
   // Упражнение 3. Перегрузка операций операндов различных типов
   //  Exercise3();
   // Упражнение 4. Перегрузка оператора индексации
   //  Exercise4();


   // Контрольные задания
   // Задание 1. Перегрузка операторов в классе Time
   // ControlTask1();
   // Задание 2. Реализация сортировки точек в векторе
   //ControlTask2();
}