#include "Exercises.h"
#include <iostream>


using namespace std;

int main()
{
   // Упражнение 1. Реализация сущности – студент в виде класса
   // Exercise1();
   // Упражнение 2. Разделение реализации и представления
   // Exercise1();
   // Упражнение 3. Создание и удаление объекта
    Exercise3();
   // Упражнение 4. Применение кортежей для представления данных
   //  Exercise4();
   // Упражнение 5. Возвращение кортежа из функции
   // Exercise5();


   // Контрольные задания
   // Задание 1. Структура Time
   // ControlTask1();
   // Задание 2. Решение квадратного уравнения
   // ControlTask2();
   // Задание 3. Решение квадратного уравнения
   //ControlTask3();
}