#include "Exercises.h"
#include <iostream>

using namespace std;

int main()
{
   // Упражнение 1. Обработка данных массива
   //Exercise1();
   // Упражнение 2. Сортировка массива
   //Exercise2(); 
   // Упражнение 3. Использование указателя на функцию
   //Exercise3(); 
   // Упражнение 4. Реализация динамического массива
   //Exercise4();
   // Упражнение 5. Применение структур данных для хранения элементов
   // Задание 1. Сохранение результатов в массиве
   //Exercise51();
   // Задание 2. Сохранение набора результатов неизвестного размера
   //Exercise52();

   // Контрольные задания
   // Задание 1. Передача массива в функцию
   ControlTask1();
   // Задание 2. Возврат массива из функции
   //ControlTask2();
   // Задание 3. Реализация алгоритмов поиска методом транспозиции
   // ControlTask3();
   // Задание 4. Передача параметров в программу
   //ControlTask4();
}

