#include "Exercises.h"
#include <iostream>

using namespace std;

int main()
{  
   // Упражнение 1. Использование функции при организации программы
   //Exercise1();
   //Задание 2. Реализация возвращения значения функции
   //Exercise2();
   //Exercise3();
   //Exercise4();
   //Упражнение 4. Применение рекурсивной функции
   //Exercise5();
   
   // Контрольные задания
   //Задание 1. Проверка номера СНИЛС
   //ControlTask1();
   //Задание 2. Применение итерации реализации функции
   ControlTask2();

}

